soap-builder/src/test/resources/services/test17/operations/StockQuoteSoapBinding/GetLastTradePrice.request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:stoc="http://reficio.org/stockquote.wsdl" xmlns:stoc1="http://reficio.org/stockquote.xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <stoc:GetLastTradePrice>
         <stoc1:TradePriceRequest>
            <tickerSymbol>?</tickerSymbol>
         </stoc1:TradePriceRequest>
      </stoc:GetLastTradePrice>
   </soapenv:Body>
</soapenv:Envelope>
